Repository: fulvous/veritech
Catalog: bash/locale/*/LC_MESSAGES/*.po
Languages: es

# getopts_unknown_option
source: Unknown option given
es: Opción desconocida

# getopts_debug_enabled
source: Debug enabled by user
es: Usuario habilitó debug

# debug_current_platform
source: Current platform:
es: Plataforma actual:

source: Unsupported platform:
es: Plataforma no soportada:

# not_root
source: Not running with root permissions
es: No tiene permisos de superusuario

source: Unsupported OS Version
es: Versión de sistema no soportada

# first_run
source: Executed for first time, setting environment
es: Primera ejecución, arreglando el ambiente

# need_to_install
source: Dependencies needed, installing
es: Hacen falta dependencias, se instalarán

# welcome_title
source: Welcome
es: Bienvenido

# welcome_content
source: Welcome to VERITECH a simple TUI OpenVPN administration tool. This tool will: * Install * Configure * Manage an OpenVPN server from command line. Do you want to continue?
es: Bienvenido a VERITECH, un administrador sencillo para servidores OpenVPN. Con Veritech podrás: * Instalar * Configurar * Administrar un servidor OpenVPN desde la línea de comandos. ¿Quieres continuar?

# dialog_back_title
source: VERITECH: OpenVPN TUI Administrator
es: VERITECH: Administrador gráfico en consola de OpenVPN

# easy-rsa_content
source: Setting easy-rsa environment: * Creating /etc/openvpn/easy-rsa * Copying easy-rsa * Backing up vars to ./data/backup
es: Creando el ambiente para easy-rsa: * Creando /etc/openvpn/easy-rsa * Copiando easy-rsa * Respaldando vars a ./data/backup

# easy-rsa_title
source: Setting easy-rsa
es: Configurando easy-rsa

# get_server_title
source: Enter your FQDN server name or IP address:
es: Ingresa el nombre FQDN o al dirección IP de tu servidor:

source: Your server name
es: Nombre de tu servidor

# wrong_data_title
source: Wrong input
es: Datos incorrectos

# wrong_server_address
source: The server address you entered is wrong, please enter a FQDN or an IP address.
es: El nombre o la dirección IP de tu servidor es incorrecto, recuerda usar un FQDN o una dirección IPv4.

# get_port_title
source: Enter Port
es: Puerto

# get_port_content
source: Enter a port number for your server to work, default is 1194
es: Ingresa el puerto que tu servidor usará, el estándar es 1194

# wrong_port
source: You entered a bad port, select a port from 1 to 65535.
es: Ingresaste un puerto incorrecto, recuerda que puedes usar desde el 1 al 65535.

# get_protocol_title
source: Protocol
es: Protocolo

# get_protocol_content
source: Select the protocol you want to use:
es: Selecciona el protocolo a utilizar:

# get_ou_title
source: Organizational Unit
es: Unidad Organizacional

# get_ou_content
source: Enter your Department (OU):
es: Ingresa tu departamento (OU):

# your_ou
source: IT Department
es: Sistemas

# get_country_title
source: Select Country
es: País

# get_country_content
source: Select your country code:
es: Seleccione el código de su país:

# wrong_ou
source: Organizational Unit too short or special character used
es: Nombre de departamento muy corto o con caractéres especiales

# wrong_province
source: Pronvice name too short or special character used
es: Nombre de provincia muy corto o con caractéres especiales

# get_province_title
source: Province
es: Provincia

# get_province_content
source: Enter your province name:
es: Ingrese el nombre de su Provincia:

source: Your Province
es: Su provincia

# wrong_city
source: City name too short or special character used
es: Nombre de ciudad muy corto o con caractéres especiales

# get_city_title
source: City
es: Ciudad

# get_city_content
source: Enter your city name:
es: Ingrese el nombre de su ciudad:

source: Your City
es: Su Ciudad

# wrong_organization
source: Organization name too short or special character used
es: Nombre de organización muy corto o con caractéres especiales

# get_organization_title
source: Organization
es: Organización

# get_organization_content
source: Enter your organization name:
es: Ingrese el nombre de su organización:

source: Your Organization
es: Su organización

# wrong_email
source: Wrong email entered, please check
es: Correo electrónico inválido, verifique

# get_email_title
source: e-mail
es: Correo electrónico

# get_email_content
source: Enter your e-mail:
es: Ingrese su correo electrónico:

# your_email
source: your@email.com
es: mi@email.com

# validate_title
source: Data validation
es: Validación de datos

# validate_content
source: Please validate your information
es: Por favor valide los datos ingresados

source: Country
es: País

source: Province
es: Provincia

source: City
es: Ciudad

source: Organization
es: Organización

# department
source: Department (OU)
es: Departamento (OU)

source: E-mail
es: Correo electrónico

# server_name
source: Server name (IP)
es: Nombre del servidor (IP)

source: Server protocol
es: Protocolo del servidor

source: Server Port
es: Puerto del servidor

# get_key_size_title
source: Key size
es: Tamaño de llave

# get_key_size_content
source: Select your key size. Remember: The bigger, the stronger, but also the slowest
es: Seleccione el tamaño de llave. Recuerde: Mientras más grande la llave, más segura, pero también más lento.

source: Key size
es: Tamaño de llave

# server_cert_title
source: Server Certificate
es: Certificado del servidor

# server_cert_content
source: Building server certificate: * Clean old certificates * Build new CA * Build new key server * Build Delfie Helman This may take a while...
es: Creando el certificado del servidor: * Borrando otros certificados * Creando CA * Creando llave del servidor * Creando Delfie Hellman Esto puede demorar...
